output/ignite-sql-c-10-1000Mbps-3ms-5000-10000-4-run-1.out
[12:19:30][INFO ][Thread-3] Start Ignite client node.
[12:19:30][INFO ][Thread-3] 

>>>    __________  ________________  
>>>   /  _/ ___/ |/ /  _/_  __/ __/  
>>>  _/ // (7 7    // /  / / / _/    
>>> /___/\___/_/|_/___/ /_/ /___/   
>>> 
>>> ver. 2.7.0#20181130-sha1:256ae401
>>> 2018 Copyright(C) Apache Software Foundation
>>> 
>>> Ignite documentation: http://ignite.apache.org

[12:19:30][INFO ][Thread-3] Config URL: n/a
[12:19:30][INFO ][Thread-3] IgniteConfiguration [igniteInstanceName=YCSB client node, pubPoolSize=12, svcPoolSize=12, callbackPoolSize=12, stripedPoolSize=12, sysPoolSize=12, mgmtPoolSize=4, igfsPoolSize=12, dataStreamerPoolSize=12, utilityCachePoolSize=12, utilityCacheKeepAliveTime=60000, p2pPoolSize=2, qryPoolSize=12, igniteHome=null, igniteWorkDir=/tmp/ignite/work, mbeanSrv=com.sun.jmx.mbeanserver.JmxMBeanServer@954b04f, nodeId=efcd3124-df22-46e4-ab48-f89ff7fa9719, marsh=BinaryMarshaller [], marshLocJobs=false, daemon=false, p2pEnabled=false, netTimeout=2000, sndRetryDelay=1000, sndRetryCnt=3, metricsHistSize=10000, metricsUpdateFreq=2000, metricsExpTime=9223372036854775807, discoSpi=TcpDiscoverySpi [addrRslvr=null, sockTimeout=0, ackTimeout=0, marsh=null, reconCnt=10, reconDelay=2000, maxAckTimeout=600000, forceSrvMode=false, clientReconnectDisabled=false, internalLsnr=null], segPlc=STOP, segResolveAttempts=2, waitForSegOnStart=true, allResolversPassReq=true, segChkFreq=10000, commSpi=TcpCommunicationSpi [connectGate=null, connPlc=org.apache.ignite.spi.communication.tcp.TcpCommunicationSpi$FirstConnectionPolicy@2970843e, enableForcibleNodeKill=false, enableTroubleshootingLog=false, locAddr=null, locHost=null, locPort=47100, locPortRange=100, shmemPort=-1, directBuf=true, directSndBuf=false, idleConnTimeout=600000, connTimeout=5000, maxConnTimeout=600000, reconCnt=10, sockSndBuf=32768, sockRcvBuf=32768, msgQueueLimit=0, slowClientQueueLimit=0, nioSrvr=null, shmemSrv=null, usePairedConnections=false, connectionsPerNode=1, tcpNoDelay=true, filterReachableAddresses=false, ackSndThreshold=32, unackedMsgsBufSize=0, sockWriteTimeout=2000, boundTcpPort=-1, boundTcpShmemPort=-1, selectorsCnt=6, selectorSpins=0, addrRslvr=null, ctxInitLatch=java.util.concurrent.CountDownLatch@6c599916[Count = 1], stopping=false], evtSpi=org.apache.ignite.spi.eventstorage.NoopEventStorageSpi@4d4cb71e, colSpi=NoopCollisionSpi [], deploySpi=LocalDeploymentSpi [], indexingSpi=org.apache.ignite.spi.indexing.noop.NoopIndexingSpi@4fc1f835, addrRslvr=null, encryptionSpi=org.apache.ignite.spi.encryption.noop.NoopEncryptionSpi@38875a4a, clientMode=true, rebalanceThreadPoolSize=1, txCfg=TransactionConfiguration [txSerEnabled=false, dfltIsolation=REPEATABLE_READ, dfltConcurrency=PESSIMISTIC, dfltTxTimeout=0, txTimeoutOnPartitionMapExchange=0, pessimisticTxLogSize=0, pessimisticTxLogLinger=10000, tmLookupClsName=null, txManagerFactory=null, useJtaSync=false], cacheSanityCheckEnabled=true, discoStartupDelay=60000, deployMode=SHARED, p2pMissedCacheSize=100, locHost=null, timeSrvPortBase=31100, timeSrvPortRange=100, failureDetectionTimeout=10000, sysWorkerBlockedTimeout=null, clientFailureDetectionTimeout=30000, metricsLogFreq=60000, hadoopCfg=null, connectorCfg=ConnectorConfiguration [jettyPath=null, host=null, port=11211, noDelay=true, directBuf=false, sndBufSize=32768, rcvBufSize=32768, idleQryCurTimeout=600000, idleQryCurCheckFreq=60000, sndQueueLimit=0, selectorCnt=4, idleTimeout=7000, sslEnabled=false, sslClientAuth=false, sslCtxFactory=null, sslFactory=null, portRange=100, threadPoolSize=12, msgInterceptor=null], odbcCfg=null, warmupClos=null, atomicCfg=AtomicConfiguration [seqReserveSize=1000, cacheMode=PARTITIONED, backups=1, aff=null, grpName=null], classLdr=null, sslCtxFactory=null, platformCfg=null, binaryCfg=null, memCfg=null, pstCfg=null, dsCfg=null, activeOnStart=true, autoActivation=true, longQryWarnTimeout=3000, sqlConnCfg=null, cliConnCfg=ClientConnectorConfiguration [host=null, port=10800, portRange=100, sockSndBufSize=0, sockRcvBufSize=0, tcpNoDelay=true, maxOpenCursorsPerConn=128, threadPoolSize=12, idleTimeout=0, jdbcEnabled=true, odbcEnabled=true, thinCliEnabled=true, sslEnabled=false, useIgniteSslCtxFactory=true, sslClientAuth=false, sslCtxFactory=null], mvccVacuumThreadCnt=2, mvccVacuumFreq=5000, authEnabled=false, failureHnd=null, commFailureRslvr=null]
[12:19:30][INFO ][Thread-3] Daemon mode: off
[12:19:30][INFO ][Thread-3] OS: Linux 4.9.0-11-amd64 amd64
[12:19:30][INFO ][Thread-3] OS user: root
[12:19:30][INFO ][Thread-3] PID: 579
[12:19:30][INFO ][Thread-3] Language runtime: Java Platform API Specification ver. 1.8
[12:19:30][INFO ][Thread-3] VM information: OpenJDK Runtime Environment 1.8.0_282-b08 Oracle Corporation OpenJDK 64-Bit Server VM 25.282-b08
[12:19:30][INFO ][Thread-3] VM total memory: 14.0GB
[12:19:30][INFO ][Thread-3] Remote Management [restart: off, REST: off, JMX (remote: off)]
[12:19:30][INFO ][Thread-3] Logger: Log4J2Logger [quiet=false, config=file:/opt/ycsb-0.17.0/ignite-binding/lib/ignite-binding-0.17.0.jar!/log4j2.xml]
[12:19:30][INFO ][Thread-3] IGNITE_HOME=null
[12:19:30][INFO ][Thread-3] VM arguments: []
[12:19:30][INFO ][Thread-3] Configured caches [in 'sysMemPlc' dataRegion: ['ignite-sys-cache']]
[12:19:30][WARN ][Thread-3] Please set system property '-Djava.net.preferIPv4Stack=true' to avoid possible problems in mixed environments.
[12:19:30][INFO ][Thread-3] Configured plugins:
[12:19:30][INFO ][Thread-3]   ^-- None
[12:19:30][INFO ][Thread-3] 
[12:19:30][INFO ][Thread-3] Configured failure handler: [hnd=StopNodeOrHaltFailureHandler [tryStop=false, timeout=0, super=AbstractFailureHandler [ignoredFailureTypes=[SYSTEM_WORKER_BLOCKED]]]]
[12:19:30][INFO ][Thread-3] Successfully bound communication NIO server to TCP port [port=47100, locHost=0.0.0.0/0.0.0.0, selectorsCnt=6, selectorSpins=0, pairedConn=false]
[12:19:30][WARN ][Thread-3] Message queue limit is set to 0 which may lead to potential OOMEs when running cache operations in FULL_ASYNC or PRIMARY_SYNC modes due to message queues growth on sender and receiver sides.
[12:19:30][WARN ][Thread-3] Checkpoints are disabled (to enable configure any GridCheckpointSpi implementation)
[12:19:31][WARN ][Thread-3] Collision resolution is disabled (all jobs will be activated upon arrival).
[12:19:31][INFO ][Thread-3] Security status [authentication=off, tls/ssl=off]
[12:19:31][INFO ][Thread-3] Evict partition permits=3
[12:19:31][INFO ][Thread-3] Client connector processor has started on TCP port 10800
[12:19:31][INFO ][Thread-3] REST protocols do not start on client node. To start the protocols on client node set '-DIGNITE_REST_START_ON_CLIENT=true' system property.
[12:19:31][INFO ][Thread-3] Non-loopback local IPs: 192.168.48.11
[12:19:31][INFO ][Thread-3] Enabled local MACs: 0242C0A8300B
[12:19:32][INFO ][disco-notifier-worker-#46%YCSB client node%] Assigned mvcc coordinator [crd=MvccCoordinator [nodeId=3d35b181-2418-49bb-a651-01f0603165e9, crdVer=1614082511039, topVer=AffinityTopologyVersion [topVer=21, minorTopVer=0]], crdNode=TcpDiscoveryNode [id=3d35b181-2418-49bb-a651-01f0603165e9, addrs=[127.0.0.1, 192.168.48.8], sockAddrs=[82ae2f26fd6d/192.168.48.8:47500, /127.0.0.1:47500], discPort=47500, order=1, intOrder=1, lastExchangeTime=1614082772063, loc=false, ver=2.7.0#20181130-sha1:256ae401, isClient=false]]
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Started exchange init [topVer=AffinityTopologyVersion [topVer=21, minorTopVer=0], mvccCrd=MvccCoordinator [nodeId=3d35b181-2418-49bb-a651-01f0603165e9, crdVer=1614082511039, topVer=AffinityTopologyVersion [topVer=21, minorTopVer=0]], mvccCrdChange=true, crd=false, evt=NODE_JOINED, evtNode=efcd3124-df22-46e4-ab48-f89ff7fa9719, customEvt=null, allowMerge=true]
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Components activation performed in 0 ms.
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=ignite-sys-cache, id=-2100569601, memoryPolicyName=sysMemPlc, mode=REPLICATED, atomicity=TRANSACTIONAL, backups=2147483647, mvcc=false], encryptionEnabled=false]
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Starting caches on local join performed in 172 ms.
[12:19:32][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:43258, rmtAddr=82ae2f26fd6d/192.168.48.8:47100]
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Sending Single Message performed in 27 ms.
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Finished exchange init [topVer=AffinityTopologyVersion [topVer=21, minorTopVer=0], crd=false]
[12:19:32][INFO ][sys-#49%YCSB client node%] Received full message, will finish exchange [node=3d35b181-2418-49bb-a651-01f0603165e9, resVer=AffinityTopologyVersion [topVer=21, minorTopVer=0]]
[12:19:32][INFO ][sys-#49%YCSB client node%] Affinity initialization on local join performed in 12 ms.
[12:19:32][INFO ][sys-#49%YCSB client node%] Affinity changes applied in 13 ms.
[12:19:32][INFO ][sys-#49%YCSB client node%] Full map updating for 2 groups performed in 2 ms.
[12:19:32][INFO ][sys-#49%YCSB client node%] Finish exchange future [startVer=AffinityTopologyVersion [topVer=21, minorTopVer=0], resVer=AffinityTopologyVersion [topVer=21, minorTopVer=0], err=null]
[12:19:32][INFO ][sys-#49%YCSB client node%] Finish proxy initialization, cacheName=ignite-sys-cache, localNodeId=efcd3124-df22-46e4-ab48-f89ff7fa9719
[12:19:32][INFO ][sys-#49%YCSB client node%] Completed partition exchange [localNode=efcd3124-df22-46e4-ab48-f89ff7fa9719, exchange=GridDhtPartitionsExchangeFuture [topVer=AffinityTopologyVersion [topVer=21, minorTopVer=0], evt=NODE_JOINED, evtNode=TcpDiscoveryNode [id=efcd3124-df22-46e4-ab48-f89ff7fa9719, addrs=[127.0.0.1, 192.168.48.11], sockAddrs=[/127.0.0.1:0, 4636630271dd/192.168.48.11:0], discPort=0, order=21, intOrder=0, lastExchangeTime=1614082771860, loc=true, ver=2.7.0#20181130-sha1:256ae401, isClient=true], done=true], topVer=AffinityTopologyVersion [topVer=21, minorTopVer=0], durationFromInit=303]
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Skipping rebalancing (no affinity changes) [top=AffinityTopologyVersion [topVer=21, minorTopVer=0], rebTopVer=AffinityTopologyVersion [topVer=-1, minorTopVer=0], evt=NODE_JOINED, evtNode=efcd3124-df22-46e4-ab48-f89ff7fa9719, client=true]
[12:19:32][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:59158, rmtAddr=365e70f7eb49/192.168.48.6:47100]
[12:19:32][INFO ][Thread-3] Performance suggestions for grid 'YCSB client node' (fix if possible)
[12:19:32][INFO ][Thread-3] To disable, set -DIGNITE_PERFORMANCE_SUGGESTIONS_DISABLED=true
[12:19:32][INFO ][Thread-3]   ^-- Enable G1 Garbage Collector (add '-XX:+UseG1GC' to JVM options)
[12:19:32][INFO ][Thread-3]   ^-- Specify JVM heap max size (add '-Xmx<size>[g|G|m|M|k|K]' to JVM options)
[12:19:32][INFO ][Thread-3]   ^-- Set max direct memory size if getting 'OOME: Direct buffer memory' (add '-XX:MaxDirectMemorySize=<size>[g|G|m|M|k|K]' to JVM options)
[12:19:32][INFO ][Thread-3]   ^-- Disable processing of calls to System.gc() (add '-XX:+DisableExplicitGC' to JVM options)
[12:19:32][INFO ][Thread-3] Refer to this page for more performance suggestions: https://apacheignite.readme.io/docs/jvm-and-system-tuning
[12:19:32][INFO ][Thread-3] 
[12:19:32][INFO ][Thread-3] To start Console Management & Monitoring run ignitevisorcmd.{sh|bat}
[12:19:32][INFO ][Thread-3] 

>>> +----------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db
>>> +----------------------------------------------------------------------+
>>> OS name: Linux 4.9.0-11-amd64 amd64
>>> CPU(s): 12
>>> Heap: 14.0GB
>>> VM name: 579@4636630271dd
>>> Ignite instance name: YCSB client node
>>> Local node [ID=EFCD3124-DF22-46E4-AB48-F89FF7FA9719, order=21, clientMode=true]
>>> Local node addresses: [4636630271dd/127.0.0.1, /192.168.48.11]
>>> Local ports: TCP:10800 TCP:47100 

[12:19:32][INFO ][Thread-3] Topology snapshot [ver=21, locNode=efcd3124, servers=10, clients=1, state=ACTIVE, CPUs=132, offheap=130.0GB, heap=24.0GB]
[12:19:32][INFO ][Thread-3] Activate Ignite cluster.
[12:19:32][INFO ][Thread-3] Sending activate request from node [id=efcd3124-df22-46e4-ab48-f89ff7fa9719, topVer=AffinityTopologyVersion [topVer=21, minorTopVer=0], client=true, daemon=false]
[12:19:32][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:49142, rmtAddr=d5bd3459cded/192.168.48.12:47100]
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Started cache [name=usertable, id=358348515, memoryPolicyName=null, mode=PARTITIONED, atomicity=ATOMIC, backups=1, mvcc=false], encryptionEnabled=false]
[12:19:32][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:36766, rmtAddr=6ad29304aed9/192.168.48.10:47100]
[12:19:32][INFO ][exchange-worker-#48%YCSB client node%] Finish proxy initialization, cacheName=usertable, localNodeId=efcd3124-df22-46e4-ab48-f89ff7fa9719
[12:19:33][INFO ][grid-nio-worker-tcp-comm-4-#36%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:46772, rmtAddr=2120ee4f4a6e/192.168.48.9:47100]
[12:19:33][INFO ][grid-nio-worker-tcp-comm-5-#37%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:56184, rmtAddr=9c953c0abe33/192.168.48.4:47100]
[12:19:33][INFO ][grid-nio-worker-tcp-comm-0-#32%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:38820, rmtAddr=0a475cc1ab9e/192.168.48.7:47100]
[12:19:33][INFO ][grid-nio-worker-tcp-comm-1-#33%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:42262, rmtAddr=42bab988eec7/192.168.48.2:47100]
[12:19:33][INFO ][grid-nio-worker-tcp-comm-2-#34%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:55232, rmtAddr=6c4e502238f7/192.168.48.5:47100]
[12:19:33][INFO ][grid-nio-worker-tcp-comm-3-#35%YCSB client node%] Established outgoing communication connection [locAddr=/192.168.48.11:33198, rmtAddr=894008bd016f/192.168.48.3:47100]
[12:19:38][INFO ][Thread-6] Stopped cache [cacheName=ignite-sys-cache]
[12:19:38][INFO ][Thread-6] Stopped cache [cacheName=usertable]
[12:19:38][INFO ][Thread-6] 

>>> +---------------------------------------------------------------------------------+
>>> Ignite ver. 2.7.0#20181130-sha1:256ae4012cb143b4855b598b740a6f3499ead4db stopped OK
>>> +---------------------------------------------------------------------------------+
>>> Ignite instance name: YCSB client node
>>> Grid uptime: 00:00:05.663


[OVERALL], RunTime(ms), 7954
[OVERALL], Throughput(ops/sec), 628.6145335680161
[TOTAL_GCS_PS_Scavenge], Count, 3
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 25
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.31430726678400805
[TOTAL_GCS_PS_MarkSweep], Count, 2
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 60
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.7543374402816193
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 85
[TOTAL_GC_TIME_%], Time(%), 1.0686447070656273
[READ], Operations, 5000
[READ], AverageLatency(us), 4182.1426
[READ], MinLatency(us), 3490
[READ], MaxLatency(us), 146431
[READ], 95thPercentileLatency(us), 4499
[READ], 99thPercentileLatency(us), 4883
[READ], Return=OK, 5000
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 29841.0
[CLEANUP], MinLatency(us), 7
[CLEANUP], MaxLatency(us), 119359
[CLEANUP], 95thPercentileLatency(us), 119359
[CLEANUP], 99thPercentileLatency(us), 119359